The hanger will disconnect because we can't find the suitable host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FabricationHangerHostNotFound { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationHangerHostNotFound As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationHangerHostNotFound {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace